Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1150/periph/PERI_IOMUXC_GPR.h
/*
** ###################################################################
**     Processors:          MIMXRT1151DHM8B
**                          MIMXRT1151DVM8B
**                          MIMXRT1151XHM8B
**                          MIMXRT1151XVM8B
**                          MIMXRT1152AHM6B
**                          MIMXRT1152AVM6B
**                          MIMXRT1152DHM8B
**                          MIMXRT1152DVM8B
**                          MIMXRT1152XHM8B
**                          MIMXRT1152XVM8B
**
**     Version:             rev. 0.2, 2026-02-26
**     Build:               b260707
**
**     Abstract:
**         CMSIS Peripheral Access Layer for IOMUXC_GPR
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2026-01-09)
**         Initial version.
**     - rev. 0.2 (2026-02-26)
**         Update header file based on RM Rev1.
**
** ###################################################################
*/

/*!
 * @file PERI_IOMUXC_GPR.h
 * @version 0.2
 * @date 2026-02-26
 * @brief CMSIS Peripheral Access Layer for IOMUXC_GPR
 *
 * CMSIS Peripheral Access Layer for IOMUXC_GPR
 */

#if !defined(PERI_IOMUXC_GPR_H_)
#define PERI_IOMUXC_GPR_H_                       /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1151DHM8B) || defined(CPU_MIMXRT1151DVM8B) || defined(CPU_MIMXRT1151XHM8B) || defined(CPU_MIMXRT1151XVM8B))
#include "../MIMXRT1151_COMMON.h"
#elif (defined(CPU_MIMXRT1152AHM6B) || defined(CPU_MIMXRT1152AVM6B) || defined(CPU_MIMXRT1152DHM8B) || defined(CPU_MIMXRT1152DVM8B) || defined(CPU_MIMXRT1152XHM8B) || defined(CPU_MIMXRT1152XVM8B))
#include "../MIMXRT1152_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- IOMUXC_GPR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_GPR_Peripheral_Access_Layer IOMUXC_GPR Peripheral Access Layer
 * @{
 */

/** IOMUXC_GPR - Register Layout Typedef */
typedef struct {
  __IO uint32_t GPR0;                              /**< GPR0 General Purpose Register, offset: 0x0 */
  __IO uint32_t GPR1;                              /**< GPR1 General Purpose Register, offset: 0x4 */
  __IO uint32_t GPR2;                              /**< GPR2 General Purpose Register, offset: 0x8 */
  __IO uint32_t GPR3;                              /**< GPR3 General Purpose Register, offset: 0xC */
  __IO uint32_t GPR4;                              /**< GPR4 General Purpose Register, offset: 0x10 */
  __IO uint32_t GPR5;                              /**< GPR5 General Purpose Register, offset: 0x14 */
  __IO uint32_t GPR6;                              /**< GPR6 General Purpose Register, offset: 0x18 */
  __IO uint32_t GPR7;                              /**< GPR7 General Purpose Register, offset: 0x1C */
  __IO uint32_t GPR8;                              /**< GPR8 General Purpose Register, offset: 0x20 */
  __IO uint32_t GPR9;                              /**< GPR9 General Purpose Register, offset: 0x24 */
  __IO uint32_t GPR10;                             /**< GPR10 General Purpose Register, offset: 0x28 */
  __IO uint32_t GPR11;                             /**< GPR11 General Purpose Register, offset: 0x2C */
  __IO uint32_t GPR12;                             /**< GPR12 General Purpose Register, offset: 0x30 */
  __IO uint32_t GPR13;                             /**< GPR13 General Purpose Register, offset: 0x34 */
  __IO uint32_t GPR14;                             /**< GPR14 General Purpose Register, offset: 0x38 */
  __IO uint32_t GPR15;                             /**< GPR15 General Purpose Register, offset: 0x3C */
  __IO uint32_t GPR16;                             /**< GPR16 General Purpose Register, offset: 0x40 */
  __IO uint32_t GPR17;                             /**< GPR17 General Purpose Register, offset: 0x44 */
  __IO uint32_t GPR18;                             /**< GPR18 General Purpose Register, offset: 0x48 */
       uint8_t RESERVED_0[4];
  __IO uint32_t GPR20;                             /**< GPR20 General Purpose Register, offset: 0x50 */
  __IO uint32_t GPR21;                             /**< GPR21 General Purpose Register, offset: 0x54 */
  __IO uint32_t GPR22;                             /**< GPR22 General Purpose Register, offset: 0x58 */
  __IO uint32_t GPR23;                             /**< GPR23 General Purpose Register, offset: 0x5C */
  __IO uint32_t GPR24;                             /**< GPR24 General Purpose Register, offset: 0x60 */
  __IO uint32_t GPR25;                             /**< GPR25 General Purpose Register, offset: 0x64 */
  __IO uint32_t GPR26;                             /**< GPR26 General Purpose Register, offset: 0x68 */
  __IO uint32_t GPR27;                             /**< GPR27 General Purpose Register, offset: 0x6C */
  __IO uint32_t GPR28;                             /**< GPR28 General Purpose Register, offset: 0x70 */
  __IO uint32_t GPR29;                             /**< GPR29 General Purpose Register, offset: 0x74 */
  __IO uint32_t GPR30;                             /**< GPR30 General Purpose Register, offset: 0x78 */
  __IO uint32_t GPR31;                             /**< GPR31 General Purpose Register, offset: 0x7C */
  __IO uint32_t GPR32;                             /**< GPR32 General Purpose Register, offset: 0x80 */
  __IO uint32_t GPR33;                             /**< GPR33 General Purpose Register, offset: 0x84 */
  __IO uint32_t GPR34;                             /**< GPR34 General Purpose Register, offset: 0x88 */
  __IO uint32_t GPR35;                             /**< GPR35 General Purpose Register, offset: 0x8C */
  __IO uint32_t GPR36;                             /**< GPR36 General Purpose Register, offset: 0x90 */
  __IO uint32_t GPR37;                             /**< GPR37 General Purpose Register, offset: 0x94 */
  __IO uint32_t GPR38;                             /**< GPR38 General Purpose Register, offset: 0x98 */
  __IO uint32_t GPR39;                             /**< GPR39 General Purpose Register, offset: 0x9C */
  __IO uint32_t GPR40;                             /**< GPR40 General Purpose Register, offset: 0xA0 */
  __IO uint32_t GPR41;                             /**< GPR41 General Purpose Register, offset: 0xA4 */
  __IO uint32_t GPR42;                             /**< GPR42 General Purpose Register, offset: 0xA8 */
  __IO uint32_t GPR43;                             /**< GPR43 General Purpose Register, offset: 0xAC */
  __IO uint32_t GPR44;                             /**< GPR44 General Purpose Register, offset: 0xB0 */
  __IO uint32_t GPR45;                             /**< GPR45 General Purpose Register, offset: 0xB4 */
  __IO uint32_t GPR46;                             /**< GPR46 General Purpose Register, offset: 0xB8 */
  __IO uint32_t GPR47;                             /**< GPR47 General Purpose Register, offset: 0xBC */
  __IO uint32_t GPR48;                             /**< GPR48 General Purpose Register, offset: 0xC0 */
  __IO uint32_t GPR49;                             /**< GPR49 General Purpose Register, offset: 0xC4 */
  __IO uint32_t GPR50;                             /**< GPR50 General Purpose Register, offset: 0xC8 */
  __IO uint32_t GPR51;                             /**< GPR51 General Purpose Register, offset: 0xCC */
  __IO uint32_t GPR52;                             /**< GPR52 General Purpose Register, offset: 0xD0 */
  __IO uint32_t GPR53;                             /**< GPR53 General Purpose Register, offset: 0xD4 */
  __IO uint32_t GPR54;                             /**< GPR54 General Purpose Register, offset: 0xD8 */
  __IO uint32_t GPR55;                             /**< GPR55 General Purpose Register, offset: 0xDC */
       uint8_t RESERVED_1[12];
  __IO uint32_t GPR59;                             /**< GPR59 General Purpose Register, offset: 0xEC */
       uint8_t RESERVED_2[8];
  __IO uint32_t GPR62;                             /**< GPR62 General Purpose Register, offset: 0xF8 */
  __I  uint32_t GPR63;                             /**< GPR63 General Purpose Register, offset: 0xFC */
  __IO uint32_t GPR64;                             /**< GPR64 General Purpose Register, offset: 0x100 */
  __IO uint32_t GPR65;                             /**< GPR65 General Purpose Register, offset: 0x104 */
  __IO uint32_t GPR66;                             /**< GPR66 General Purpose Register, offset: 0x108 */
  __IO uint32_t GPR67;                             /**< GPR67 General Purpose Register, offset: 0x10C */
  __IO uint32_t GPR68;                             /**< GPR68 General Purpose Register, offset: 0x110 */
  __IO uint32_t GPR69;                             /**< GPR69 General Purpose Register, offset: 0x114 */
  __IO uint32_t GPR70;                             /**< GPR70 General Purpose Register, offset: 0x118 */
  __IO uint32_t GPR71;                             /**< GPR71 General Purpose Register, offset: 0x11C */
  __IO uint32_t GPR72;                             /**< GPR72 General Purpose Register, offset: 0x120 */
  __IO uint32_t GPR73;                             /**< GPR73 General Purpose Register, offset: 0x124 */
  __IO uint32_t GPR74;                             /**< GPR74 General Purpose Register, offset: 0x128 */
  __I  uint32_t GPR75;                             /**< GPR75 General Purpose Register, offset: 0x12C */
  __I  uint32_t GPR76;                             /**< GPR76 General Purpose Register, offset: 0x130 */
} IOMUXC_GPR_Type;

/* ----------------------------------------------------------------------------
   -- IOMUXC_GPR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_GPR_Register_Masks IOMUXC_GPR Register Masks
 * @{
 */

